app/controllers/distributos_controller.rb

   def new
    @distributo = Distributivo.new
    @periodo = Periodo.order("period_fech_ini").last

    @clase = Clase.find(:all)
    @malla =[]
    @niveles = []
    @asignaturas = []

    @profesores = Persona.joins(:tipos).where(:tipos =>{:tip_descrip => "PROFESOR"}).search(params[:search]).order(sort_column+ ' ' + sort_direction)
---
SELECT "periodos".* FROM "periodos" ORDER BY period_fech_ini DESC LIMIT 1
SELECT "personas".* FROM "personas" INNER JOIN "personas_tipos" ON "personas_tipos"."persona_id" = "personas"."id" INNER JOIN "tipos" ON "tipos"."id" = "personas_tipos"."tipo_id" WHERE "tipos"."tip_descrip" = 'PROFESOR' ORDER BY id asc

   def index
     @periodo = Periodo.order("period_fech_ini").find(:last)
     @distributos = Distributivo.joins(:curso =>:periodo).where(:periodos => {:id => @periodo.id})
---
SELECT "distributivos".* FROM "distributivos" INNER JOIN "cursos" ON "cursos"."id" = "distributivos"."curso_id" INNER JOIN "periodos" ON "periodos"."id" = "cursos"."periodo_id" WHERE "periodos"."id" = 3

   def update_niveles
    @periodo = Periodo.order("period_fech_ini").last
    malla = Malla.joins(:nivels => {:cursos => :periodo}).where(:clase_id => params[:clase_id], :periodos => {:id => @periodo.id}).last#.pluck("mall_estado")
    nivel = Nivel.joins(:mallas).where(:mallas => {:id => malla.id}).uniq
---
SELECT "periodos".* FROM "periodos" ORDER BY period_fech_ini DESC LIMIT 1
SELECT "mallas".* FROM "mallas" INNER JOIN "mults" ON "mults"."malla_id" = "mallas"."id" INNER JOIN "nivels" ON "nivels"."id" = "mults"."nivel_id" INNER JOIN "cursos" ON "cursos"."nivel_id" = "nivels"."id" INNER JOIN "periodos" ON "periodos"."id" = "cursos"."periodo_id" WHERE "mallas"."clase_id" = 0 AND "periodos"."id" = 3 ORDER BY "mallas"."id" DESC LIMIT 1
SELECT DISTINCT "nivels".* FROM "nivels" INNER JOIN "mults" ON "mults"."nivel_id" = "nivels"."id" INNER JOIN "mallas" ON "mallas"."id" = "mults"."malla_id" WHERE "mallas"."id" = 11

   def update_asignaturas
      @periodo = Periodo.order("period_fech_ini").last
      nivel = Nivel.find(params[:nivel_id])
      @cursos = Curso.where(:nivel_id => nivel.id, :periodo_id => @periodo.id).order("cur_paralelo")
      malla = Malla.joins(:nivels).where(:nivels => {:id => nivel.id}).last
      @asignaturas = Asignatura.joins(:mallas).where(:mults => {:malla_id => malla.id, :nivel_id => nivel.id})
      @profesores = Persona.joins(:tipos).where(:tipos =>{:tip_descrip => "PROFESOR"}).search(params[:search]).order(sort_column+ ' ' + sort_direction)
---
SELECT "periodos".* FROM "periodos" ORDER BY period_fech_ini DESC LIMIT 1
SELECT "nivels".* FROM "nivels" WHERE "nivels"."id" = ? LIMIT 1  [["id", "6"]]
SELECT "cursos".* FROM "cursos" WHERE "cursos"."nivel_id" = 6 AND "cursos"."periodo_id" = 3 ORDER BY cur_paralelo
SELECT "mallas".* FROM "mallas" INNER JOIN "mults" ON "mults"."malla_id" = "mallas"."id" INNER JOIN "nivels" ON "nivels"."id" = "mults"."nivel_id" WHERE "nivels"."id" = 6 ORDER BY "mallas"."id" DESC LIMIT 1
SELECT "asignaturas".* FROM "asignaturas" INNER JOIN "mults" ON "mults"."asignatura_id" = "asignaturas"."id" INNER JOIN "mallas" ON "mallas"."id" = "mults"."malla_id" WHERE "mults"."malla_id" = 11 AND "mults"."nivel_id" = 6
SELECT "personas".* FROM "personas" INNER JOIN "personas_tipos" ON "personas_tipos"."persona_id" = "personas"."id" INNER JOIN "tipos" ON "tipos"."id" = "personas_tipos"."tipo_id" WHERE "tipos"."tip_descrip" = 'PROFESOR' ORDER BY id asc