app/controllers/mallacurriculares_controller.rb

  def index
   @periodos_count = Periodo.count()
   if @periodos_count > 1
     @ultimo_periodo = Periodo.order("period_fech_ini").find(:last)
   else
     @ultimo_periodo = Periodo.order("period_fech_ini").find(:first)
   end
   @mallas = Malla.where(:mall_fech_fin => @ultimo_periodo.period_fech_fin)
---
SELECT COUNT(*) FROM "periodos"
SELECT "mallas".* FROM "mallas" WHERE "mallas"."mall_fech_fin" = '2017-10-04'

  def new
    @asignatura = Asignatura.all
    @clase = Clase.find(:all)
    @nivel = Nivel.all
---
SELECT "asignaturas".* FROM "asignaturas"
SELECT "nivels".* FROM "nivels"