app/controllers/niveles_controller.rb

  def index
    @nivel= Nivel.find(:all)
    @nivele= Nivele.find(:all)
---
SELECT "niveles".* FROM "niveles" WHERE "niveles"."id" = 2 LIMIT 1