app/controllers/secretariasis_controller.rb

  def ind_mall
  @periodos_count = Periodo.count()
---
SELECT COUNT(*) FROM "periodos"

  def buscar
    if params[:cedula_estudiante]==nil
      @estudiante = nil
      @usuario = nil
      @matricula = nil
      @representante = nil
    else
      @estudiante = Persona.find_by_pers_cedula(params[:cedula_estudiante])
      @usuario = User.find_by_persona_id(@estudiante.id)
      @matricula = Matricula.where(:persona_id=>@estudiante.id).last
      @representante = Persona.joins(:representantes).where(:representantes=>{:estudiante_id =>@estudiante.id}).first
---
SELECT "personas".* FROM "personas" WHERE "personas"."pers_cedula" = '0706045119' LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."persona_id" = 41 LIMIT 1
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."persona_id" = 41 ORDER BY "matriculas"."id" DESC LIMIT 1
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 28]]
SELECT "personas".* FROM "personas" INNER JOIN "representantes" ON "representantes"."persona_id" = "personas"."id" WHERE "representantes"."estudiante_id" = 41 LIMIT 1

  def historial
    # params[:estudiante] ES EL ID DE LA PERSONA
    @persona = Persona.find(params[:estudiante])
    @matriculas = Matricula.where(:persona_id => params[:estudiante])
---
SELECT "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", "40"]]
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."persona_id" = 40

  def edit_historial
    matricula = Matricula.find(params[:matricula_id])
    @calificaciones = Calificacione.where(:matricula_id => matricula.id)
    @persona = Persona.find(params[:persona_id])
---
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."id" = ? LIMIT 1  [["id", "45"]]
SELECT "calificaciones".* FROM "calificaciones" WHERE "calificaciones"."matricula_id" = 45
SELECT "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", "40"]]

  def update_cursos
    curso = Curso.joins(:nivel).where(:nivel_id=>params[:nivel_id], :periodo_id => params[:periodo_id])
    @periodo = Periodo.find(params[:periodo_id])
---
SELECT "cursos".* FROM "cursos" INNER JOIN "nivels" ON "nivels"."id" = "cursos"."nivel_id" WHERE "cursos"."nivel_id" = 5 AND "cursos"."periodo_id" = 1
SELECT "periodos".* FROM "periodos" WHERE "periodos"."id" = ? LIMIT 1  [["id", "1"]]

  def update_homo
    @asignaturas = Asignatura.joins(:nivels).where(:nivels=>{:id=>params[:nivel_id]}).uniq
    @periodo = Periodo.find(params[:periodo_id])
    @asig_count = 0
    @asignaturas.each do
      @asig_count+=1
    end
    @persona = Persona.find(params[:persona_id])
    @curso = Curso.find(params[:curso_id])
---
SELECT DISTINCT "asignaturas".* FROM "asignaturas" INNER JOIN "mults" ON "mults"."asignatura_id" = "asignaturas"."id" INNER JOIN "nivels" ON "nivels"."id" = "mults"."nivel_id" WHERE "nivels"."id" = 5
SELECT "periodos".* FROM "periodos" WHERE "periodos"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", "40"]]
SELECT "cursos".* FROM "cursos" WHERE "cursos"."id" = ? LIMIT 1  [["id", "31"]]

  def edit_matr_alum
    periodo_last = Periodo.order("period_fech_ini").last
    @cursos_last = Curso.where(:periodo_id=>periodo_last.id)
    @persona = Persona.find(params[:estudiante])
---
SELECT "periodos".* FROM "periodos" ORDER BY period_fech_ini DESC LIMIT 1
SELECT "cursos".* FROM "cursos" WHERE "cursos"."periodo_id" = 3
SELECT "personas".* FROM "personas" WHERE "personas"."id" = ? LIMIT 1  [["id", "40"]]