app/controllers/secretarias_controller.rb

SELECT "estudios".* FROM "estudios" WHERE "estudios"."persona_id" = 39
SELECT "laborals".* FROM "laborals" WHERE "laborals"."persona_id" = 39
---
   def curriculsecretari
    @estudio = Estudio.where(:persona_id => current_user.persona.id)
    @laboral = Laboral.where(:persona_id => current_user.persona.id)