app/controllers/sessions_controller.rb

SELECT "periodos".* FROM "periodos" ORDER BY period_fech_ini DESC LIMIT 1
SELECT "matriculas".* FROM "matriculas" WHERE "matriculas"."persona_id" = 33 ORDER BY "matriculas"."id" DESC LIMIT 1
---
  def create
    user = login(params[:username], params[:password], params[:remember_me])
    if user
      if user.usu_estado == "A"
        @periodo_actual = Periodo.order("period_fech_ini").last()
        matricula = Matricula.where(:persona_id => current_user.persona_id).last()